# Desafio 2: Administração de Condomínios

In [78]:
import pandas as pd
import numpy as np

In [79]:
dados_d2 = pd.read_json("dados_locacao_imoveis.json")
dados_d2.head()

                                       dados_locacao
0  {'apartamento': 'A101 (blocoAP)', 'datas_combi...
1  {'apartamento': 'A102 (blocoAP)', 'datas_combi...
2  {'apartamento': 'B201 (blocoAP)', 'datas_combi...
3  {'apartamento': 'B202 (blocoAP)', 'datas_combi...
4  {'apartamento': 'C301 (blocoAP)', 'datas_combi...

In [80]:
dados_d2 = pd.json_normalize(dados_d2["dados_locacao"])
dados_d2.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"
1,A102 (blocoAP),"[02/06/2022, 02/07/2022]","[02/06/2022, 06/07/2022]","[$ 1100,0 reais, $ 2600,0 reais]"
2,B201 (blocoAP),"[03/06/2022, 03/07/2022]","[07/06/2022, 03/07/2022]","[$ 1200,0 reais, $ 2700,0 reais]"
3,B202 (blocoAP),"[04/06/2022, 04/07/2022]","[07/06/2022, 05/07/2022]","[$ 1300,0 reais, $ 2800,0 reais]"
4,C301 (blocoAP),"[05/06/2022, 05/07/2022]","[10/06/2022, 09/07/2022]","[$ 1400,0 reais, $ 2900,0 reais]"

In [81]:
colounas_d2 = list(dados_d2)
colounas_d2

['apartamento',
 'datas_combinadas_pagamento',
 'datas_de_pagamento',
 'valor_aluguel']

In [82]:
dados_d2 = dados_d2.explode(colounas_d2[1:])
dados_d2.reset_index(inplace=True, drop=True)
dados_d2.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),01/06/2022,05/06/2022,"$ 1000,0 reais"
1,A101 (blocoAP),01/07/2022,03/07/2022,"$ 2500,0 reais"
2,A102 (blocoAP),02/06/2022,02/06/2022,"$ 1100,0 reais"
3,A102 (blocoAP),02/07/2022,06/07/2022,"$ 2600,0 reais"
4,B201 (blocoAP),03/06/2022,07/06/2022,"$ 1200,0 reais"

In [83]:
dados_d2["valor_aluguel"] = dados_d2["valor_aluguel"].apply(lambda x: x.replace("$", "").replace("reais", "").replace(",", ".").strip())
dados_d2.head()

      apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022        1000.0
1  A101 (blocoAP)                 01/07/2022         03/07/2022        2500.0
2  A102 (blocoAP)                 02/06/2022         02/06/2022        1100.0
3  A102 (blocoAP)                 02/07/2022         06/07/2022        2600.0
4  B201 (blocoAP)                 03/06/2022         07/06/2022        1200.0

In [84]:
dados_d2["valor_aluguel"] = dados_d2["valor_aluguel"].astype(np.float64)
dados_d2.info()
dados_d2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     float64
dtypes: float64(1), object(3)
memory usage: 1.1+ KB

      apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022         1000.0
1  A101 (blocoAP)                 01/07/2022         03/07/2022         2500.0
2  A102 (blocoAP)                 02/06/2022         02/06/2022         1100.0
3  A102 (blocoAP)                 02/07/2022         06/07/2022         2600.0
4  B201 (blocoAP)                 03/06/2022         07/06/2022         1200.0

In [85]:
dados_d2["apartamento"] = dados_d2["apartamento"].str.replace("(blocoAP)", "")
dados_d2["apartamento"] = dados_d2["apartamento"].str.strip()
dados_d2["apartamento"]

0     A101
1     A101
2     A102
3     A102
4     B201
5     B201
6     B202
7     B202
8     C301
9     C301
10    C302
11    C302
12    D401
13    D401
14    D402
15    D402
16    E501
17    E501
18    E502
19    E502
20    F601
21    F601
22    F602
23    F602
24    G701
25    G701
26    G702
27    G702
28    H801
29    H801
Name: apartamento, dtype: object

In [89]:
colounas_datas_d2=["datas_combinadas_pagamento", "datas_de_pagamento"]

In [92]:
dados_d2[colounas_datas_d2]=dados_d2[colounas_datas_d2].apply(lambda x: pd.to_datetime(x, format= "%d/%m/%Y"))

In [93]:
dados_d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     datetime64[ns]
 2   datas_de_pagamento          30 non-null     datetime64[ns]
 3   valor_aluguel               30 non-null     float64
dtypes: datetime64[ns](2), float64(1), object(1)
memory usage: 1.1+ KB

In [96]:
dados_d2["atraso"]=dados_d2["datas_combinadas_pagamento"]-dados_d2["datas_de_pagamento"]
dados_d2.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,atraso
0,A101,2022-06-01,2022-06-05,1000.0,-4 days
1,A101,2022-07-01,2022-07-03,2500.0,-2 days
2,A102,2022-06-02,2022-06-02,1100.0,0 days
3,A102,2022-07-02,2022-07-06,2600.0,-4 days
4,B201,2022-06-03,2022-06-07,1200.0,-4 days

In [97]:
dados_d2.groupby(["apartamento"])["atraso"].mean()

apartamento
A101   -3 days +00:00:00
A102   -2 days +00:00:00
B201   -2 days +00:00:00
B202   -2 days +00:00:00
C301   -5 days +12:00:00
C302   -4 days +00:00:00
D401   -1 days +00:00:00
D402   -4 days +00:00:00
E501   -1 days +12:00:00
E502   -4 days +00:00:00
F601   -4 days +00:00:00
F602   -2 days +12:00:00
G701   -7 days +12:00:00
G702   -2 days +00:00:00
H801   -2 days +00:00:00
Name: atraso, dtype: timedelta64[ns]